IDEA Open Model
ValueCount Class
Compatible with IDEA StatiCa v 10.1
 Specifies pair of value and their count.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.ValueCount
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public sealed class ValueCount
Public NotInheritable Class ValueCount
public ref class ValueCount sealed
The ValueCount type exposes the following members.
Constructors
Name | Description
ValueCount
Initializes a new instance of the ValueCount class
Top
Properties
Name | Description
Count
 Gets or sets the repeating of value.
Value
 Gets or sets the value.
Top
Methods
Name | Description
Create(Double)
 Creates a new instance with specified value.
Create(Double, Int32)
 Creates a new instance with value and their repeating.
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace